案例/水银的层流流动问题/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
 
    INLET
    { 
        type            fixedValue;
        value           uniform 300;
    }

    "(SIDE1|SIDE2)"
    {
        type            wedge;
    }

    OUTLET
    {
        type            zeroGradient;

    }

    WALL
    {
        // type            fixedValue;
        // value           uniform 340;

        type            fixedGradient;
        gradient        uniform 585.48;
    }
}


// ************************************************************************* //
